src/logs/desempenho/cenario1/ack-1/log--1-10000-12.out
Topic to send: test-topic
Topic to acks: -1
Records: 80000
Size:10000
984 records sent, 196,8 records/sec (1,88 MB/sec), 5,0 ms avg latency, 257,0 ms max latency.
1138 records sent, 227,6 records/sec (2,17 MB/sec), 4,4 ms avg latency, 6,0 ms max latency.
1147 records sent, 229,4 records/sec (2,19 MB/sec), 4,3 ms avg latency, 16,0 ms max latency.
1173 records sent, 234,5 records/sec (2,24 MB/sec), 4,2 ms avg latency, 5,0 ms max latency.
1169 records sent, 233,7 records/sec (2,23 MB/sec), 4,3 ms avg latency, 32,0 ms max latency.
1177 records sent, 235,3 records/sec (2,24 MB/sec), 4,2 ms avg latency, 45,0 ms max latency.
1178 records sent, 235,6 records/sec (2,25 MB/sec), 4,2 ms avg latency, 48,0 ms max latency.
1210 records sent, 241,9 records/sec (2,31 MB/sec), 4,1 ms avg latency, 30,0 ms max latency.
1209 records sent, 241,7 records/sec (2,31 MB/sec), 4,1 ms avg latency, 15,0 ms max latency.
1206 records sent, 241,1 records/sec (2,30 MB/sec), 4,1 ms avg latency, 23,0 ms max latency.
1190 records sent, 237,9 records/sec (2,27 MB/sec), 4,2 ms avg latency, 24,0 ms max latency.
1201 records sent, 240,1 records/sec (2,29 MB/sec), 4,2 ms avg latency, 5,0 ms max latency.
1174 records sent, 234,7 records/sec (2,24 MB/sec), 4,2 ms avg latency, 66,0 ms max latency.
1195 records sent, 239,0 records/sec (2,28 MB/sec), 4,2 ms avg latency, 42,0 ms max latency.
1211 records sent, 242,1 records/sec (2,31 MB/sec), 4,1 ms avg latency, 21,0 ms max latency.
1200 records sent, 239,9 records/sec (2,29 MB/sec), 4,2 ms avg latency, 15,0 ms max latency.
1203 records sent, 240,6 records/sec (2,29 MB/sec), 4,1 ms avg latency, 23,0 ms max latency.
1193 records sent, 238,5 records/sec (2,27 MB/sec), 4,2 ms avg latency, 20,0 ms max latency.
1197 records sent, 239,4 records/sec (2,28 MB/sec), 4,2 ms avg latency, 5,0 ms max latency.
1177 records sent, 235,3 records/sec (2,24 MB/sec), 4,2 ms avg latency, 47,0 ms max latency.
1188 records sent, 237,5 records/sec (2,27 MB/sec), 4,2 ms avg latency, 90,0 ms max latency.
1202 records sent, 240,3 records/sec (2,29 MB/sec), 4,1 ms avg latency, 16,0 ms max latency.
1201 records sent, 240,2 records/sec (2,29 MB/sec), 4,1 ms avg latency, 5,0 ms max latency.
1194 records sent, 238,8 records/sec (2,28 MB/sec), 4,2 ms avg latency, 22,0 ms max latency.
1177 records sent, 235,3 records/sec (2,24 MB/sec), 4,2 ms avg latency, 101,0 ms max latency.
1015 records sent, 202,9 records/sec (1,93 MB/sec), 4,9 ms avg latency, 621,0 ms max latency.
1178 records sent, 235,5 records/sec (2,25 MB/sec), 4,2 ms avg latency, 46,0 ms max latency.
1191 records sent, 238,1 records/sec (2,27 MB/sec), 4,2 ms avg latency, 22,0 ms max latency.
1214 records sent, 242,7 records/sec (2,31 MB/sec), 4,1 ms avg latency, 15,0 ms max latency.
1172 records sent, 234,4 records/sec (2,23 MB/sec), 4,2 ms avg latency, 94,0 ms max latency.
1176 records sent, 235,2 records/sec (2,24 MB/sec), 4,2 ms avg latency, 48,0 ms max latency.
1193 records sent, 238,5 records/sec (2,27 MB/sec), 4,2 ms avg latency, 67,0 ms max latency.
1195 records sent, 238,9 records/sec (2,28 MB/sec), 4,2 ms avg latency, 21,0 ms max latency.
1199 records sent, 239,7 records/sec (2,29 MB/sec), 4,2 ms avg latency, 13,0 ms max latency.
1203 records sent, 240,5 records/sec (2,29 MB/sec), 4,1 ms avg latency, 17,0 ms max latency.
1195 records sent, 238,9 records/sec (2,28 MB/sec), 4,2 ms avg latency, 22,0 ms max latency.
1219 records sent, 243,7 records/sec (2,32 MB/sec), 4,1 ms avg latency, 5,0 ms max latency.
1196 records sent, 239,2 records/sec (2,28 MB/sec), 4,2 ms avg latency, 19,0 ms max latency.
1169 records sent, 233,7 records/sec (2,23 MB/sec), 4,3 ms avg latency, 65,0 ms max latency.
1208 records sent, 241,5 records/sec (2,30 MB/sec), 4,1 ms avg latency, 9,0 ms max latency.
1229 records sent, 245,8 records/sec (2,34 MB/sec), 4,1 ms avg latency, 5,0 ms max latency.
1191 records sent, 238,1 records/sec (2,27 MB/sec), 4,2 ms avg latency, 23,0 ms max latency.
1205 records sent, 240,9 records/sec (2,30 MB/sec), 4,1 ms avg latency, 5,0 ms max latency.
1198 records sent, 239,5 records/sec (2,28 MB/sec), 4,2 ms avg latency, 46,0 ms max latency.
1184 records sent, 236,8 records/sec (2,26 MB/sec), 4,2 ms avg latency, 80,0 ms max latency.
1199 records sent, 239,7 records/sec (2,29 MB/sec), 4,2 ms avg latency, 5,0 ms max latency.
1218 records sent, 243,5 records/sec (2,32 MB/sec), 4,1 ms avg latency, 8,0 ms max latency.
1214 records sent, 242,8 records/sec (2,32 MB/sec), 4,1 ms avg latency, 23,0 ms max latency.
1228 records sent, 245,6 records/sec (2,34 MB/sec), 4,1 ms avg latency, 18,0 ms max latency.
1208 records sent, 241,5 records/sec (2,30 MB/sec), 4,1 ms avg latency, 14,0 ms max latency.
1191 records sent, 238,1 records/sec (2,27 MB/sec), 4,2 ms avg latency, 75,0 ms max latency.
1203 records sent, 240,6 records/sec (2,29 MB/sec), 4,1 ms avg latency, 22,0 ms max latency.
1200 records sent, 239,9 records/sec (2,29 MB/sec), 4,2 ms avg latency, 25,0 ms max latency.
1199 records sent, 239,7 records/sec (2,29 MB/sec), 4,2 ms avg latency, 5,0 ms max latency.
1194 records sent, 238,8 records/sec (2,28 MB/sec), 4,2 ms avg latency, 22,0 ms max latency.
1201 records sent, 240,2 records/sec (2,29 MB/sec), 4,1 ms avg latency, 5,0 ms max latency.
1194 records sent, 238,8 records/sec (2,28 MB/sec), 4,2 ms avg latency, 23,0 ms max latency.
1195 records sent, 238,9 records/sec (2,28 MB/sec), 4,2 ms avg latency, 58,0 ms max latency.
1208 records sent, 241,6 records/sec (2,30 MB/sec), 4,1 ms avg latency, 7,0 ms max latency.
1204 records sent, 240,7 records/sec (2,30 MB/sec), 4,1 ms avg latency, 23,0 ms max latency.
1188 records sent, 237,6 records/sec (2,27 MB/sec), 4,2 ms avg latency, 23,0 ms max latency.
1201 records sent, 240,1 records/sec (2,29 MB/sec), 4,1 ms avg latency, 5,0 ms max latency.
1218 records sent, 243,5 records/sec (2,32 MB/sec), 4,1 ms avg latency, 5,0 ms max latency.
1171 records sent, 234,2 records/sec (2,23 MB/sec), 4,3 ms avg latency, 49,0 ms max latency.
1195 records sent, 239,0 records/sec (2,28 MB/sec), 4,2 ms avg latency, 45,0 ms max latency.
1204 records sent, 240,7 records/sec (2,30 MB/sec), 4,1 ms avg latency, 20,0 ms max latency.
1228 records sent, 245,6 records/sec (2,34 MB/sec), 4,1 ms avg latency, 8,0 ms max latency.
80000 records sent, 237,738630 records/sec (2,27 MB/sec), 4,19 ms avg latency, 621,00 ms max latency, 4 ms 50th, 5 ms 95th, 5 ms 99th, 16 ms 99.9th.

Metric Name                                                                          Value
app-info:commit-id:{client-id=producer-1}                                          : d4284cbebb6f0a4c
app-info:start-time-ms:{client-id=producer-1}                                      : 1590729375225
app-info:version:{client-id=producer-1}                                            : 2.3.1
kafka-metrics-count:count:{client-id=producer-1}                                   : 126,000
producer-metrics:batch-size-avg:{client-id=producer-1}                             : 10077,000
producer-metrics:batch-size-max:{client-id=producer-1}                             : 10077,000
producer-metrics:batch-split-rate:{client-id=producer-1}                           : 0,000
producer-metrics:batch-split-total:{client-id=producer-1}                          : 0,000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                     : 33554432,000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                      : 0,000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                     : 0,000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                         : 33554432,000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                      : 0,000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                 : 0,000
producer-metrics:compression-rate-avg:{client-id=producer-1}                       : 1,000
producer-metrics:connection-close-rate:{client-id=producer-1}                      : 0,000
producer-metrics:connection-close-total:{client-id=producer-1}                     : 0,000
producer-metrics:connection-count:{client-id=producer-1}                           : 4,000
producer-metrics:connection-creation-rate:{client-id=producer-1}                   : 0,000
producer-metrics:connection-creation-total:{client-id=producer-1}                  : 4,000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                 : 0,000
producer-metrics:failed-authentication-total:{client-id=producer-1}                : 0,000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}               : 0,000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}              : 0,000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                         : 14867,034
producer-metrics:incoming-byte-total:{client-id=producer-1}                        : 4961746,000
producer-metrics:io-ratio:{client-id=producer-1}                                   : 0,014
producer-metrics:io-time-ns-avg:{client-id=producer-1}                             : 19280,424
producer-metrics:io-wait-ratio:{client-id=producer-1}                              : 0,966
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                        : 1353572,620
producer-metrics:io-waittime-total:{client-id=producer-1}                          : 324832925532,000
producer-metrics:iotime-total:{client-id=producer-1}                               : 4657925326,000
producer-metrics:metadata-age:{client-id=producer-1}                               : 36,347
producer-metrics:network-io-rate:{client-id=producer-1}                            : 479,541
producer-metrics:network-io-total:{client-id=producer-1}                           : 160012,000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                         : 2433146,494
producer-metrics:outgoing-byte-total:{client-id=producer-1}                        : 811749072,000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                  : 0,000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                  : 0,000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}               : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}               : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-error-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                      : 0,024
producer-metrics:record-queue-time-max:{client-id=producer-1}                      : 1,000
producer-metrics:record-retry-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-retry-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-send-rate:{client-id=producer-1}                           : 239,794
producer-metrics:record-send-total:{client-id=producer-1}                          : 80000,000
producer-metrics:record-size-avg:{client-id=producer-1}                            : 10092,000
producer-metrics:record-size-max:{client-id=producer-1}                            : 10092,000
producer-metrics:records-per-request-avg:{client-id=producer-1}                    : 1,000
producer-metrics:request-latency-avg:{client-id=producer-1}                        : 4,108
producer-metrics:request-latency-max:{client-id=producer-1}                        : 49,000
producer-metrics:request-rate:{client-id=producer-1}                               : 239,770
producer-metrics:request-size-avg:{client-id=producer-1}                           : 10147,000
producer-metrics:request-size-max:{client-id=producer-1}                           : 10147,000
producer-metrics:request-total:{client-id=producer-1}                              : 80006,000
producer-metrics:requests-in-flight:{client-id=producer-1}                         : 0,000
producer-metrics:response-rate:{client-id=producer-1}                              : 239,791
producer-metrics:response-total:{client-id=producer-1}                             : 80006,000
producer-metrics:select-rate:{client-id=producer-1}                                : 713,379
producer-metrics:select-total:{client-id=producer-1}                               : 239563,000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1}  : 0,000
producer-metrics:successful-authentication-rate:{client-id=producer-1}             : 0,000
producer-metrics:successful-authentication-total:{client-id=producer-1}            : 0,000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}           : 0,000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}          : 0,000
producer-metrics:waiting-threads:{client-id=producer-1}                            : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}    : 4986,830
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-3}    : 5000,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-6}    : 4889,736
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--2}  : 579,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}   : 1655359,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-3}   : 1659662,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-6}   : 1646146,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}    : 816060,671
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-3}    : 818261,254
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-6}    : 800216,264
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--2}  : 67,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}   : 270819803,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-3}   : 271570513,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-6}   : 269358689,000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}   : 4,485
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-3}   : 3,863
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-6}   : 3,974
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}   : 24,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-3}   : 45,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-6}   : 49,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--2}         : 0,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}          : 80,422
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-3}          : 80,636
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-6}          : 78,858
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}      : 10147,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-3}      : 10147,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-6}      : 10147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}      : 10147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-3}      : 10147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-6}      : 10147,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--2}        : 2,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}         : 26692,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-3}         : 26765,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-6}         : 26547,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--2}        : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}         : 80,433
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-3}         : 80,645
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-6}         : 78,867
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--2}       : 2,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}        : 26692,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-3}        : 26765,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-6}        : 26547,000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=test-topic}          : 2416335,603
producer-topic-metrics:byte-total:{client-id=producer-1, topic=test-topic}         : 806148890,000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=test-topic}   : 1,000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=test-topic}   : 239,794
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=test-topic}  : 80000,000
Produce Time: 336.503
Aplication time: 337.211